lib/app/views/checkouts/user_history.html.erb

  <tbody>
  <% books = Checkout.where(user_id: current_user.id).reverse %>
---
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."user_id" = ?  [["user_id", 5]]