lib/app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins"
---
  def index
    @admins = Admin.all

INSERT INTO "admins" ("email", "encrypted_password", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 1]]
---
  def destroy
	if(@admin.id ==6 || @admin.id == current_admin.id)
    respond_to do |format|
      format.html { redirect_to admins_url, notice: 'Cannot Delete this admin.' }
      format.json { head :no_content }
   end
   else
   @admin.destroy

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ?  ORDER BY "admins"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_admin
      @admin = Admin.find(params[:id])