lib/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (ISBN LIKE '%asj%' or title LIKE '%asj%' or description LIKE '%asj%' or author LIKE '%asj%') AND "books"."suggested" = ?  [["suggested", "f"]]
SELECT "books".* FROM "books"  ORDER BY created_at DESC
---
  def index
    #@books = Book.all
    #if params[:search]
    #  @books = Book.search(params[:search]).order("created_at DESC")
    #else
    #  @books = Book.order("created_at DESC")
    #end
	if params[:search]
	   @search="%#{params[:search]}%"
      #@books = Book.search(params[:search]).order("created_at DESC")
	  @books = Book.where("ISBN LIKE ? or title LIKE ? or description LIKE ? or author LIKE ?", @search, @search, @search, @search).where.not(suggested: 't')

    else
      @books = Book.order("created_at DESC").where.not(suggested: 't')

SELECT "books".* FROM "books" WHERE "books"."suggested" = ?  [["suggested", "t"]]
---
  def suggested_books
    @books = Book.where(suggested: 't')

SELECT "versions".* FROM "versions"  ORDER BY created_at DESC
---
  def history
  @versions = PaperTrail::Version.order('created_at DESC')

SELECT "books".* FROM "books"  ORDER BY created_at DESC
---
  def book_search
   @books = Book.order("created_at DESC")

INSERT INTO "books" ("ISBN", "title", "description", "author", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["ISBN", ""], ["title", ""], ["description", ""], ["author", ""], ["status", "sdf"], ["created_at", "2015-09-25 18:44:23.952296"], ["updated_at", "2015-09-25 18:44:23.952296"]]
---
  def create

	@book = Book.new(book_params)

  if (user_signed_in?)
    @book.suggested = true
  else
    @book.suggested = false
  end

  @book.status = "Available"


    respond_to do |format|
      if @book.save

UPDATE "books" SET "description" = ?, "author" = ?, "status" = ?, "user" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "jamescxvdfdfggg"], ["author", "charliexcvxcvdf"], ["status", "yaydfsd"], ["user", "jabbarsd"], ["updated_at", "2015-09-24 20:44:23.068745"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)