lib/app/controllers/checkouts_controller.rb

  def index
    @checkouts = Checkout.all
---
SELECT "checkouts".* FROM "checkouts"

  def create
	#@checkout = Checkout.new
	#@checkout.book_id = @book.id
	#@checkout.user_id = @user_id
   @checkout = Checkout.new(checkout_params)
	book = Book.find(@checkout.book_id)
	#book = Book.new
 	if(@checkout.status == 'Checkout')
		@checkout.user_id = current_user.id


		book.update(status: 'Checkout', user_id: @checkout.user_id)
	elsif(@checkout.status == 'Return')
		@checkout.user_id= book.user_id
		book.update(status: 'Available', user_id: "")
	elsif User.where(email: @checkout.status).blank?
	@checkout.user_id = nil
	else
		user = User.find_by(email: @checkout.status)
		@checkout.user_id = user.id
		@checkout.status = 'Checkout'
		book.update(status: 'Checkout', user_id: @checkout.user_id)
	end
    respond_to do |format|
      if @checkout.user_id == nil
	  format.html { redirect_to href='/user_checkout', notice: 'Enter correct Email' }
      format.json { render :show, status: :created, location: @checkout }
	  elsif @checkout.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "books" SET "status" = ?, "user_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["status", "checkout"], ["user_id", 2], ["updated_at", "2015-09-26 00:19:36.232882"], ["id", 4]]
UPDATE "checkouts" SET "user_id" = ?, "updated_at" = ? WHERE "checkouts"."id" = ?  [["user_id", 3], ["updated_at", "2015-09-25 20:50:51.590284"], ["id", 18]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "books" ("status", "created_at", "updated_at") VALUES (?, ?, ?)  [["status", "checkout"], ["created_at", "2015-09-25 22:46:50.094517"], ["updated_at", "2015-09-25 22:46:50.094517"]]
INSERT INTO "checkouts" ("book_id", "status", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["status", "Checkout"], ["user_id", 3], ["created_at", "2015-09-25 20:01:16.490118"], ["updated_at", "2015-09-25 20:01:16.490118"]]

    def set_checkout
      @checkout = Checkout.find(params[:id])
---
SELECT  "checkouts".* FROM "checkouts" WHERE "checkouts"."id" = ? LIMIT 1  [["id", 1]]