blog/app/controllers/articles_controller.rb

	def create
		@article = Article.new(article_params)

                @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdf"], ["text", "asdf"], ["created_at", "2015-09-15 15:45:10.110842"], ["updated_at", "2015-09-15 15:45:10.110842"]]