lib/app/views/users/show.html.erb

SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."user_id" = ?  [["user_id", 2]]
---
  <tbody>
  <% books = Checkout.where(user_id: @user.id).reverse %>

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  <tbody>
  <% books = Book.where(user_id: @user.id) %>