lib/app/views/static/adminhome.html.erb

  <tbody>
  <% books = Book.where(user_id: current_user.id) %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 5]]