lib/app/views/books/show.html.erb

SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."book_id" = ?  [["book_id", 9]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  <tbody>
  <% checkouts = Checkout.where(book_id: @book.id) %>
    <% checkouts.each do |book| %>
	<% user = User.find(book.user_id) %>